//求12345678901234567890123456789012345678901234567890除以2023的余数

//解题逻辑；数太大了，采用字符串存储，进行逐位处理 （相当于除法运算，从左往右每步的余数*10+下一个数，继续除，至小数点出现） 
 #include <iostream>  
using namespace std;  

int main() {  
    int divisor = 2023;  
    int remainder = 0;  
    
    // 直接处理数字 12345678901234567890123456789012345678901234567890  
    const char* num = "12345678901234567890123456789012345678901234567890";  //字符串指针 
    
    // 逐位计算余数  
    for(int i = 0; num[i]; i++) {  
        remainder = (remainder * 10 + (num[i] - '0')) % divisor;  //保障余数的范围在0~2022之间 
    }  
    
    cout << remainder << endl;  
    
    return 0;  
}
